app/controllers/events_controller.rb

SELECT * FROM `events`
---
  def index
    @events = Event.all

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def show
    @event = Event.find(params[:id])

INSERT INTO `events` (`created_at`, `title`, `body`, `published`, `updated_at`) VALUES('2010-02-08 10:31:32', 'Chavanga Project Initialized', 'This is first try of Chavanga Project on Heroku. It\'s not so big as we think, but all news and events and activities are going go here.', 1, '2010-02-08 10:31:32')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save