app/controllers/image_gallery_images_controller.rb

SELECT * FROM `image_gallery_groups` WHERE (`image_gallery_groups`.parent_group_id = 3 AND (parent_group_id != id))
---
    def load_image_gallery_group
        @image_gallery_group = ImageGalleryGroup.find(params[:image_gallery_group_id])

INSERT INTO `image_gallery_images` (`image_gallery_group_id`, `created_at`, `title`, `updated_at`, `tag`, `description`, `visible`) VALUES(5, '2010-02-18 22:09:00', '8', '2010-02-18 22:09:00', 'fishing/p1/willage_camp/8.jpg', '', 1)
---
  def create
    @image_gallery_image = @image_gallery_group.images.new(params[:image_gallery_image])

    respond_to do |format|
      if @image_gallery_image.save

SELECT * FROM `image_gallery_images` WHERE (`image_gallery_images`.`id` = 7)
UPDATE `image_gallery_images` SET `updated_at` = '2010-02-18 22:19:45', `title` = '2', `tag` = 'fishing/p1/pokosy_camp/2.jpg' WHERE `id` = 21
---
  def update
    @image_gallery_image = ImageGalleryImage.find(params[:id])

    respond_to do |format|
      if @image_gallery_image.update_attributes(params[:image_gallery_image])