app/controllers/image_gallery_groups_controller.rb

SELECT * FROM `image_gallery_groups` WHERE (`image_gallery_groups`.parent_group_id = 4 AND (parent_group_id != id))
---
  def show
    @@pict_per_page = 20
    @image_gallery_group = ImageGalleryGroup.find( params[ :id ] )