app/controllers/partner_links_controller.rb

SELECT * FROM `partner_links`
---
  def index
    @partner_links = PartnerLink.all

SELECT * FROM `partner_links` WHERE (`partner_links`.`id` = 1)
---
  def show
    @partner_link = PartnerLink.find(params[:id])

INSERT INTO `partner_links` (`created_at`, `title`, `updated_at`, `tag`, `visible`) VALUES('2010-02-08 11:44:36', 'Developer blog', '2010-02-08 11:44:36', 'http://sidorovis.blogspot.com', 1)
---
  def create
    @partner_link = PartnerLink.new(params[:partner_link])

    respond_to do |format|
      if @partner_link.save